// Модуль управляемой формы обработки ОбменTEXHORU.
// Реквизит формы: КлючОбмена, Строка(200).
// Команды формы: ВыгрузитьФайл, ЗагрузитьФайл, ВыгрузитьHTTP, ЗагрузитьHTTP.

&НаКлиенте
Процедура ВыгрузитьФайл(Команда)
    Попытка Сообщить(ВыгрузитьФайлНаСервере()); Исключение Сообщить(ОписаниеОшибки()); КонецПопытки;
КонецПроцедуры
&НаСервере
Функция ВыгрузитьФайлНаСервере()
    Возврат ОбменTEXHORU.ВыгрузитьКаталогВФайл();
КонецФункции

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
    Попытка Сообщить(ЗагрузитьФайлНаСервере()); Исключение Сообщить(ОписаниеОшибки()); КонецПопытки;
КонецПроцедуры
&НаСервере
Функция ЗагрузитьФайлНаСервере()
    Возврат ОбменTEXHORU.ПолучитьМониторингИзФайла();
КонецФункции

&НаКлиенте
Процедура ВыгрузитьHTTP(Команда)
    Попытка Сообщить(ВыгрузитьHTTPНаСервере()); Исключение Сообщить(ОписаниеОшибки()); КонецПопытки;
КонецПроцедуры
&НаСервере
Функция ВыгрузитьHTTPНаСервере()
    Возврат ОбменTEXHORU.ВыгрузитьКаталогHTTP(КлючОбмена);
КонецФункции

&НаКлиенте
Процедура ЗагрузитьHTTP(Команда)
    Попытка Сообщить(ЗагрузитьHTTPНаСервере()); Исключение Сообщить(ОписаниеОшибки()); КонецПопытки;
КонецПроцедуры
&НаСервере
Функция ЗагрузитьHTTPНаСервере()
    Возврат ОбменTEXHORU.ПолучитьМониторингHTTP(КлючОбмена);
КонецФункции
